In [7]:
import pandas as pd

In [17]:
data1 = pd.read_excel(r'C:\Users\HP\Desktop\PG\Mydata1.xlsx')

In [18]:
data1

    Name  Age  Salary
0  pinky   30   20000
1   John   22   15000
2   Neha   25   30000
3    Raj   26   35000

In [20]:
data2 = pd.read_csv(r'C:\Users\HP\Desktop\PG\My data2.csv')

In [21]:
data2

   Roll No.    Name  Batch
0      1001  Pinki    1840
1      1002  Bulbul   1843
2      1003   Shalu   1840
3      1004  Siddhu   1765

In [44]:
data3 = pd.read_csv(r'C:\Users\HP\Desktop\PG\Mydata3.tsv',sep= '\t')

In [45]:
data3

   RollNo    Name  Batch
0    1001   pinki   1840
1    1002  siddhu   1842
2    1003  bulbul   1845
3    1004   shalu   1846